--------------------------------------------------------
--  已建立檔案 - 星期四-八月-01-2024   
--------------------------------------------------------
--------------------------------------------------------
--  DDL for Table 總表
--------------------------------------------------------

  CREATE TABLE "STUDENT"."總表" 
   (	"類別編號" VARCHAR2(20 BYTE), 
	"類別資料表" VARCHAR2(20 BYTE), 
	"村里別代號" VARCHAR2(20 BYTE), 
	"設施地址" NVARCHAR2(20), 
	"容人數量" NUMBER(*,0), 
	"地下樓層數" NUMBER(*,0), 
	"轄管分局代碼" VARCHAR2(20 BYTE)
   ) SEGMENT CREATION IMMEDIATE 
  PCTFREE 10 PCTUSED 40 INITRANS 1 MAXTRANS 255 
 NOCOMPRESS LOGGING
  STORAGE(INITIAL 65536 NEXT 1048576 MINEXTENTS 1 MAXEXTENTS 2147483645
  PCTINCREASE 0 FREELISTS 1 FREELIST GROUPS 1
  BUFFER_POOL DEFAULT FLASH_CACHE DEFAULT CELL_FLASH_CACHE DEFAULT)
  TABLESPACE "USERS" ;
REM INSERTING into STUDENT."總表"
SET DEFINE OFF;
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('1','H001','C001','苗栗縣竹南鎮中埔街20號',100,1,'M001');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('2','H002','C002','苗栗縣竹南鎮和平街79號',3142,1,'M001');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('3','H002','C003','苗栗縣竹南鎮龍山路三段142號',1072,1,'M001');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('4','H003','C004','苗栗縣後龍鎮中華路1498號',32,1,'M001');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('5','H001','C005','苗栗縣苗栗市米市街80號',106,1,'M002');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('6','H001','C005','苗栗縣苗栗市光復路117號',26,1,'M002');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('7','H002','C005','苗栗縣苗栗市博愛街109號',2038,2,'M002');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('8','H002','C005','苗栗縣苗栗市大同路53號',128,2,'M002');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('9','H003','C006','苗栗縣頭份市民族里和平路102號',353,1,'M003');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('10','H004','C007','苗栗縣頭份市忠孝忠孝一路69號',501,1,'M003');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('11','H001','C008','苗栗縣頭份市信義里中正路65號',194,1,'M003');
Insert into STUDENT."總表" ("類別編號","類別資料表","村里別代號","設施地址","容人數量","地下樓層數","轄管分局代碼") values ('12','H004','C008','苗栗縣頭份市信義里中正路116號',78,1,'M003');
